//=============================================================================
//
// エネミーモデル処理 [biru.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_BIRU		(10)					// エネミーの数

#define	BIRU_SIZE		(25.0f)				// 当たり判定の大きさ


//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct BIRU
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	bool				use;
	bool				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float				spd;				// 移動スピード
	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号
	int muki;
	int move = 1;

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBiru(void);
void UninitBiru(void);
void UpdateBiru(void);
void DrawBiru(void);

BIRU *GetBiru(void);

